<template>
    <div class="rules">
        <p>
            제 1조(목적)

            본 약관은 ㈜Aftergamez(이하 “회사”라 합니다)가 제공하는 인터넷 서비스(이하 “서비스”라 합니다)의 이용과 관련하여 회사와 회원의 권리, 의무 및 기타 필요한 사항을 규정함을 목적으로 합니다.

            제 2조(용어의 정리)

            본 약관에서 사용하는 주요한 용어의 정의는 다음과 같습니다.
            ①회원 : 회사와 서비스 이용 계약을 체결하고 회원 아이디(ID)를 부여 받은 자를 말합니다.
            ②아이디 : 회원의 식별과 회원의 서비스 이용을 위하여 회원이 선정하고 회사가 승인하는 문자나 숫자 혹은 그 조합을 말합니다(이하"ID"라 합니다).
            ③비밀번호 : 회원이 부여 받은 ID와 일치된 회원임을 확인하고, 회원 자신의 비밀을 보호하기 위하여 회원이 정한 문자와 숫자의 조합을 말합니다.
            ④닉네임 : 서비스 이용을 위하여 회원이 선정하고 회사가 승인한 문자나 숫자 혹은 그 조합으로 서비스 이용 시 회원을 구분하고 지칭하고 나타내는 명칭을 말합니다.
            ⑤이용제한 : 회사가 약관에 의거하여 회원의 서비스 이용을 제한하는 것을 말하며, 일정 기간 서비스 이용 중지, 영구적인 서비스 이용 중지, 서비스 중 일부에 대한 이용 중지를 포함합니다.


            제3조(약관의 효력 및 변경)

            ①본 약관의 내용은 회원이 쉽게 알 수 있도록 서비스 화면에 게시합니다.
            ②회사는 필요하다고 인정되는 경우 본 약관을 변경할 수 있으며, 회사가 약관을 변경할 경우에는 적용일 및 변경 내용을 명시하여 제1항의 방법으로 그 적용일의 최소 7일 전부터 공지합니다. 다만, 회원에게 불리한 약관의 변경인 경우에는 최소 30일 전부터 공지합니다. 회사는 회원에게 불리한 약관 변경의 경우 회원 정보에 기재된 이메일로 개별 통지합니다.
            ③회사가 제2항에 따라 약관의 변경을 공지 또는 통지하면서 변경 약관의 적용일까지 거부 의사를 표시하지 않으면 약관 변경에 동의한 것으로 간주한다는 내용을 공지 또는 통지하였음에도 불구하고 회원이 명시적으로 거부 의사를 표시하지 않은 경우 변경 약관에 동의한 것으로 봅니다. 회원은 변경된 약관에 동의하지 않는 경우 이용 계약을 해지할 수 있습니다.

            제4조(약관 외 준칙)

            본 약관에 명시되지 아니한 사항에 대해서는 전기통신기본법, 전기통신사업법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 및 기타 관련 법령의 규정에 따릅니다.

            제5조(이용 계약의 성립)

            이용계약은 회원이 되고자 하는 자 (이하 “가입신청자”라 합니다.)가 본 약관 및 개인정보처리방침에 동의한 다음 회원가입신청을 하고 회사가 이러한 신청을 승낙함으로써 체결됩니다.

            제6조(이용 신청의 승낙과 유보)

            ①가입신청자는 회사가 정한 소정의 양식에 필요한 정보를 입력하고 이용을 신청합니다.
            ②회사는 다음 각 호의 어느 하나에 해당하는 경우 그 사유가 해소될 때까지 승낙을 유보할 수 있습니다.
            1.서비스 관련 설비에 여유가 없는 경우
            2.기술상 지장이 있는 경우
            3.기타 위 각 호에 준하는 사유가 존재하는 경우
            ③회사는 다음 각 호의 어느 하나에 해당하는 경우 이용 신청에 대한 승낙을 거부할 수 있으며, 승낙 이후 그 사유가 발견된 경우에는 이용제한 조치를 취하거나 계약을 해지할 수 있습니다.
            1.타인의 명의를 사용하여 이용을 신청한 경우
            2.필요한 정보를 허위로 기재하여 이용을 신청한 경우
            3.만 14세 미만의 아동이 부모 등 법정 대리인의 동의를 얻지 않고 이용을 신청한 경우
            4.기타 관련 법령을 위반하거나 회사가 정한 요건에 맞지 않게 이용을 신청한 경우
            ④스스로 서비스 이용 계약을 해지한 종전 회원이 해지일로부터 60일이 지나지 않은 상태에서 이용을 신청하는 경우 회사는 이를 승낙하지 않을 수 있습니다.
            ⑤약관 위반 등을 이유로 회사에 의해 이용계약이 해지된 종전 회원이 계약 해지일로부터 1년 내에 다시 이용을 신청하는 경우 회사는 이를 승낙하지 않을 수 있습니다.

            제7조 (회원 정보의 변경)

            ①회원은 개인정보관리 화면을 통해 언제든지 본인의 개인정보를 열람하고 수정할 수 있습니다.
            ②회원은 이용 신청 시 기재한 사항이 변경되었을 경우 온라인으로 수정하거나 전자우편 기타 방법으로 회사에 변경 사항을 알려야 합니다. 회사는 회원이 변경 사항을 알리지 않아 발생한 불이익에 대하여 책임을 지지 않습니다.

            제8조 (개인 정보의 보호 및 보관 기간)

            ①회사는 “정보통신망 이용촉진 및 정보보호 등에 관한 법률”, “개인정보보호법” 등 관계 법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위해 노력합니다.
            ②개인정보처리방침의 범위 내에서 회사는 업무와 관련하여 회원 전체 또는 일부의 개인정보에 관한 집합적인 통계 자료를 작성하여 이를 사용할 수 있고 서비스를 통하여 회원의 컴퓨터에 쿠키를 전송할 수 있습니다. 이 경우 회원은 쿠키의 수신을 거부하거나 쿠키의 수신에 대하여 경고하도록 사용하는 컴퓨터의 브라우저의 설정을 변경할 수 있습니다.

            제 9조(회원의 의무)

            ①회원은 관계법령, 본 약관의 규정, 이용수칙 등 회사가 공지 또는 통지하는 사항을 준수하여야 하며, 회사의 업무를 방해하는 행위를 할 수 없습니다.
            ②회원은 회사의 사전승낙 없이 회사가 저작권을 보유한 게시물을 복제, 전송, 수정, 번역, 출판, 배포, 방송하거나 기타 방법으로 사용하거나 제3자에게 제공하거나, 영리를 목적으로 이용할 수 없습니다.
            ③회원은 회사의 사전승낙 없이 서비스를 이용하여 광고 등 영리행위를 할 수 없습니다. 회사는 사전승낙을 받지 않은 회원의 영리행위로 인해 발생한 결과에 대하여 책임을 부담하지 않습니다. 회원은 사전승낙을 받지 않은 영리행위로 인해 회사에 손해가 발생한 경우 회사에 대하여 손해배상 책임을 부담합니다.
            ④ID와 비밀번호에 관한 관리책임은 회원에게 있으며, 관리 소홀, 부정 사용 등에 의하여 발생하는 모든 결과에 대한 책임은 회원이 부담합니다.
            ⑤회원이 게시물 작성 등 서비스 이용과 관련하여 제3자의 초상권, 상표권, 저작권 및 기타 권리를 사용하고자 하는 경우에는 사전에 정당한 권리자로부터 필요한 권리를 확보하여야 하며, 권한 없는 사용으로 권리자와 분쟁이 발생한 경우에는 회원이 모든 책임을 부담합니다.

            제 10조(계약 해지 및 이용제한)

            ①회원은 언제든지 온라인을 통해 이용 계약을 해지할 수 있습니다.
            ②회사는 회원이 제8조, 제19조, 제14조를 포함하여 본 약관 조항을 위반하거나, 회사의 정상적인 서비스 운영을 방해하는 경우 사전통지 없이 경고, 일부 서비스 이용 중지, 포인트 차감, 기간을 정한 서비스 이용 중지, 영구적인 서비스 이용 중지, 이용계약 해지 등의 조치를 취할 수 있습니다.
        </p>
    </div>
</template>

<script>
    export default {
        name: "rules_detail"
    }
</script>

<style lang="scss" scoped>
.rules{
    width: 90%;
    max-width: 720px;
    margin: 0 auto;

    p{
        white-space: pre-wrap;
    }
}
</style>
